tutorials/multiphase/cavitatingFoam/les/throttle3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

interpolationSchemes
{
    default         linear;
}

divSchemes
{
    default         none;
    div(phiv,rho)   Gauss limitedLinear 0.2;
    div(phi,U)      Gauss filteredLinear2V 0.2 0;
    div(phiv,k)     Gauss filteredLinear2 0.2 0;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(nuf,rhoU) Gauss linear corrected;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(rrhoUAf,p) Gauss linear corrected;
    laplacian(rUAf,p) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(1,p)  Gauss linear corrected;
}

snGradSchemes
{
    default         none;
    snGrad(p)       corrected;
}


// ************************************************************************* //
